{
  "text": "Get permission for special drone operations Language selection WxT Language switcher Français fr / Gouvernement du Canada Search this site Customize your search tc.canada.ca canada.ca Search Menu Main Menu Home Jobs and the workplace Immigration and citizenship Travel and tourism Business and industry Health Benefits Health – More Taxes Environment and natural resources National security and defence Culture, history and sport Policing, justice and emergencies Transport and infrastructure Canada and the world Money and finances Science and innovation You are here Canada.ca Transport Canada Aviation Drone safety Drone pilot licensing Get permission for special drone operations If you want to get permission for specific drone flight operations, you will need to apply for a Special Flight Operations Certificate (SFOC) for a remotely piloted aircraft system (RPAS). An SFOC-RPAS gives you permission to operate your drone for a specific purpose under special conditions. You need an SFOC-RPAS if you want to fly your drone beyond the rules for basic and advanced operations. Foreign pilots If you are a foreign pilot or operator (not a Canadian citizen or permanent resident), you need to apply for an SFOC-RPAS. Some exceptions apply. Apply for a foreign pilot or operator SFOC-RPAS Advertised events Fly a drone at an advertised event (including microdrones). Apply for an advertised event SFOC-RPAS Medium and high-complexity operations Medium-complexity operations Flying a drone more than 150 kg Flying above 122 meters (400 feet) Flying more than 5 drones within VLOS or more than 1 drone BVLOS High-complexity operations Flying BVLOS other than sheltered operations, extended VLOS (EVLOS), and lower-risk BVLOS operations under the new Level 1 Complex regime Flying a drone with dangerous or hazardous payloads Flying BVLOS in an aerodrome environment Flying a medium-sized drone within VLOS or BVLOS in adverse weather or poor visibility Flying with a person on board Special aviation events An SFOC for a special aviation event is required when a pilot is operating a drone as a performer in the event (referred to as an “airshow” or “drone show”). Apply for a medium or high-complexity SFOC Date modified: 2025-04-01",
  "meta": {
    "title": "Get permission for special drone operations",
    "source_organization": "Transport Canada",
    "country": "Canada",
    "publication_year": 2025,
    "document_type": "unknown",
    "url": "https://tc.canada.ca/en/aviation/drone-safety/drone-pilot-licensing/get-permission-special-drone-operations",
    "trust_score": 0.9,
    "hash_id": "ee0e6de07dcee26fcfa19a62cd6a5700d0203eb032630c85f13b0779437f0ce9"
  }
}