{
  "text": "Drone innovation and collaboration Language selection WxT Language switcher Français fr / Gouvernement du Canada Search this site Customize your search tc.canada.ca canada.ca Search Menu Main Menu Home Jobs and the workplace Immigration and citizenship Travel and tourism Business and industry Health Benefits Health – More Taxes Environment and natural resources National security and defence Culture, history and sport Policing, justice and emergencies Transport and infrastructure Canada and the world Money and finances Science and innovation You are here Canada.ca Transport Canada Aviation Drone safety Drone innovation and collaboration Canadian Drone Advisory Committee, drones in the Canadian Arctic, test ranges, partnerships and collaborations. Most requested Transport Canada’s Drone Strategy to 2025 Drone Zone newsletter Contributors Transport Canada National Research Council Canada Services and information Drone innovation and collaboration in Canada Research and development projects, partnerships, collaborations. Drone innovation and collaboration abroad International partnerships, projects, collaborations. Advanced air mobility Urban Air Mobility (UAM), Regional Air Mobility (RAM), electric vertical takeoff and landing (eVTOL). Video series: Drones For Good Using drones to monitor wildlife and wildfires, delivering medical equipment, collecting geographic information. Video series: Drones and Industry Exploring the Ways Drones are Changing the World. Interviews with Delivery Canada and Bell Textron Canada. Video series: How to Save a Life with Drones Interviews with the Royal Canadian Mounted Police, Winnipeg Fire and Paramedic Service, Civil Air Search and Rescue Association. Date modified: 2025-07-30",
  "meta": {
    "title": "Drone innovation and collaboration",
    "source_organization": "Transport Canada",
    "country": "Canada",
    "publication_year": 2025,
    "document_type": "unknown",
    "url": "https://tc.canada.ca/en/aviation/drone-safety/drone-innovation-collaboration",
    "trust_score": 0.9,
    "hash_id": "3e387696608dab71fe2c3d0926088d5c45f132ffecfa8a5a6227dd4b69b37b63"
  }
}