{
  "text": "Drone Zone Language selection WxT Language switcher Français fr / Gouvernement du Canada Search this site Customize your search tc.canada.ca canada.ca Search Menu Main Menu Home Jobs and the workplace Immigration and citizenship Travel and tourism Business and industry Health Benefits Health – More Taxes Environment and natural resources National security and defence Culture, history and sport Policing, justice and emergencies Transport and infrastructure Canada and the world Money and finances Science and innovation You are here Canada.ca Transport Canada Aviation Drone safety Drone Zone Subscribe to Drone Zone The Drone Zone newsletter is a platform that the RPAS Task Force uses to communicate monthly with stakeholders (drone operators, industry, law enforcement, other government departments (OGDs), provincial/territorial contacts, academia, etc.) and serves as a central mechanism for outreach and engagement. The newsletter was first launched in 2019 and has since grown to over 1200 subscribers. Topics covered each month typically include any news on engagement efforts and the RPAS Task Force’s presence at major events (e.g.: International Civil Aviation Organization (ICAO) meetings, summits, conferences, etc.), regulatory program updates, and any other items of interest for stakeholders. On occasion, “special editions” of the newsletter will be sent out if something needs to be communicated outside of the regular publication cycle.\" Subscribe Current issues Issue title Published Drone Zone Issue 5 - December 2025 2025-12-18 Drone Zone Issue 4 - November 2025 2025-11-05 Transport Canada SET Branch Newsletter: Issue 3 — October 2025 2025-10-08 Issue 2 — June 2025 2025-06-12 Issue 1 — February 2025 2025-03-07 Date modified: 2025-11-14",
  "meta": {
    "title": "Drone Zone",
    "source_organization": "Transport Canada",
    "country": "Canada",
    "publication_year": 2019,
    "document_type": "unknown",
    "url": "https://tc.canada.ca/en/aviation/drone-safety/drone-zone",
    "trust_score": 0.9,
    "hash_id": "66999e48ff89792664548c5c604fe99d4197bb9830f044374b18ae7bcc653e3d"
  }
}