{
  "text": "Report a drone incident Language selection WxT Language switcher Français fr / Gouvernement du Canada Search this site Customize your search tc.canada.ca canada.ca Search Menu Main Menu Home Jobs and the workplace Immigration and citizenship Travel and tourism Business and industry Health Benefits Health – More Taxes Environment and natural resources National security and defence Culture, history and sport Policing, justice and emergencies Transport and infrastructure Canada and the world Money and finances Science and innovation You are here Canada.ca Transport Canada Aviation Drone safety Report a drone incident If this is an emergency (there is imminent danger presented by the drone), call 9-1-1 first . To report a privacy-related offence (e.g. being recorded in your home), please contact your local police. Report unsafe drone use Complete and submit this form if you believe someone is flying a drone in an irresponsible manner without a permit (for example, flying close to other aircraft, near aerodromes, or at a high altitude). This form is for reporting drone incidents only To report an incident relating to aircraft, airports and aerodromes: Report an aviation security incident Report an incident affecting airport or aerodrome safety Filling the form will only take you a few minutes. We will review your report and take appropriate action when necessary. Drone incident report form * Required Primary concern Is your primary concern: Safety of aviation Safety of people Privacy Other To report a privacy-related offence (e.g. being recorded in your home), please contact your local police. Enter other primary concern Date and location of incident Address Address or notable landmark where incident occurred City Province / Territory - None - Alberta British Columbia New Brunswick Manitoba Newfoundland and Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Quebec Saskatchewan Yukon Date of incident Time of incident Description of incident Was the drone flying (click all that apply): Over people at a distance of less than 100 feet (30 m) from another person, measured horizontally and at any altitude, except from a crew member or other person involved in the operation Over a crowd (sporting event, concert, festival) In cloud/poor weather Fireworks show Forest fire (or other natural disaster, i.e. flood) Near critical infrastructure Near an emergency services (police, fire, ambulance) operation Other… Other description of incident… Please provide as many details as possible (what happened): Evidence Can you identify the drone pilot? - None - Yes No Please include details below (e.g. what the pilot looked like, the state of the pilot): Do you have evidence such as photos or videos or witness statements of this incident? - None - Yes No × Status message Please note, you may only submit evidence if you provide an email address below. Contact information As we look into this report, we may need to contact you for more information. If you agree to be contacted, complete the following fields. Otherwise, leave them blank and submit your report. Can a Transport Canada Official contact you for more information regarding this report? - None - Yes No Contact First name Last name Email Phone Privacy Statement Transport Canada (TC) is committed to protecting the privacy rights of individuals and safeguarding the personal information under its control. “Personal information” is defined as any information, in any form, about an identifiable individual; refer to section 3 of the Privacy Act for further details regarding personal information. Personal information collected by TC is protected from disclosure to unauthorized persons and/or agencies subject to the provisions of the Privacy Act. Individuals have the right to the protection of and access to their personal information and to request corrections where the individual believes there is an error or omission. Individuals may contact the Department’s Access to Information and Privacy Protection Division to request corrections. The information requested is required by the Department for the purpose of regulatory follow-up and will be used to investigate. Your personal information will be shared with Transport Canada Civil Aviation for the purpose of regulatory enforcement. The information is collected under the authority of the Aeronautics Act (R.S., 1985, c. A-2). Provision of the information requested in this document is voluntary and you may, without prejudice, decline to respond. Should you decide to complete the form, it is important to know that the submission of your information constitutes consent to the collection and use of your personal information. Your personal information will be used for the following secondary purpose: statistical trend analysis. The personal information collected will be retained for seven years. The form containing personal information will be destroyed after 84 months (seven years). Disclaimer Information submitted through this form will be forwarded to a technical expert for review. Please note, however, that feedback on issues submitted through this means cannot always be provided. I authorize Transport Canada to review the issue or feedback mentioned. I further certify that the information given on this form is, to the best of my knowledge, correct and complete. Math question 4 + 13 = Solve this simple math problem and enter the result. E.g. for 1+3, enter 4. Submit Reset Date modified: 2019-12-12",
  "meta": {
    "title": "Report a drone incident",
    "source_organization": "Transport Canada",
    "country": "Canada",
    "publication_year": 2019,
    "document_type": "regulation",
    "url": "https://tc.canada.ca/en/aviation/drone-safety/report-drone-incident",
    "trust_score": 0.9,
    "hash_id": "d3602d8b4720a8a44b98aedb3b78773516bdbc40843f4f787e75d017e1ba11da"
  }
}